In [11]:
%reset -f
import pandas as pd
import plotly.express as px
from datetime import datetime as dt
import os

In [96]:
df = pd.read_csv('./data/processed/expenses_filtered_2023.csv', header=0, parse_dates=['Date'])
df1 = pd.read_csv('./data/processed/Bills.csv', header=0, dtype={'Total per year': float})
df

,Date,Amount,Transaction Type,Transaction Details,Category,Merchant Name
0,2023-01-03,12.20,MISCELLANEOUS DEBIT,V7221 29/12 BUNNINGS 614000 CROYDON 74940522363,Home,Bunnings (Croydon)
1,2023-01-03,73.15,MISCELLANEOUS DEBIT,V7155 30/12 TARGET 5419 CHADSTONE 74363962364,Shopping,Target (Chadstone)
2,2023-01-03,159.00,MISCELLANEOUS DEBIT,V7221 30/12 BABY BUNTING CHADSTONE CHADSTONE 0...,Family,Baby Bunting (Chadstone)
3,2023-01-03,10.00,MISCELLANEOUS DEBIT,V7155 31/12 KMART 1147 CHADSTONE 74363962365,Shopping,Kmart (Chadstone Shopping Centre)
4,2023-01-03,167.82,MISCELLANEOUS DEBIT,V7155 31/12 COLES 0643 CHADSTONE 74363962365,Groceries,Coles (Chadstone - The Fashion Capital)
...,...,...,...,...,...,...
255,2023-03-25,48.30,EFTPOS DEBIT,POS 25/03 COLES 0645 OAKLEIGH,Groceries,Coles (Oakleigh Central)
256,2023-03-26,171.41,EFTPOS DEBIT,POS 26/03 COLES 0645 OAKLEIGH,Groceries,Coles (Oakleigh Central)
257,2023-03-26,50.00,EFTPOS DEBIT,POS 26/03 LA FRNCS NALS&BTY PL CHADSTONE,Personal care,La Francaise Nails & Beauty
258,2023-03-26,5.20,EFTPOS DEBIT,POS 26/03 WW METRO/11-29 KOKARIBB R CARNEGIE,Groceries,Woolworths (Carnegie)
259,2023-03-26,43.60,EFTPOS DEBIT,POS 26/03 OAKLEIGH GOLF OAKLEIGH,Health,BlueFit (Oakleigh Golf Course)

In [97]:
# df = df.setindex(df['Date'], drop=False)
df4 = df.groupby([pd.Grouper(key='Date', freq='2W-Wed', closed='left', label='left')]).sum(numeric_only=True).reset_index()
data1 = data.groupby([pd.Grouper(key='Date', freq='2W-WED', closed='left', label='left'), "Category"]).sum(numeric_only=True).reset_index()
df4

        Date   Amount
0 2022-12-28  1777.69
1 2023-01-11  1584.73
2 2023-01-25  1002.72
3 2023-02-08  1505.36
4 2023-02-22  1438.84
5 2023-03-08  3437.43
6 2023-03-22   521.70

In [99]:
type(df4.iloc[-1]['Amount'])

numpy.float64